; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-42)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 - object)
 (:init 
    (arm-empty)
    (clear b12)
    (on b12 b7)
    (on b7 b8)
    (on b8 b4)
    (on b4 b6)
    (on b6 b9)
    (on b9 b5)
    (on b5 b10)
    (on b10 b3)
    (on b3 b2)
    (on b2 b1)
    (on b1 b11)
    (on-table b11))
 (:goal (and 
(clear b7) (on-table b7)
(on-table b8)
(on-table b5)
(on b2 b8)
(on b3 b5)
(on b4 b3)
(clear b10) (on b10 b4)
(on b11 b2)
(on b6 b11)
))
)

; plan
1. (unstack b12 b7)
   deleted: (on b12 b7) (clear b12) (arm-empty)
   added: (holding b12) (clear b7)
   goals met: 1 of 11
2. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 1 of 11
3. (unstack b7 b8)
   deleted: (on b7 b8) (clear b7) (arm-empty)
   added: (holding b7) (clear b8)
   goals met: 0 of 11
4. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 2 of 11
5. (unstack b8 b4)
   deleted: (on b8 b4) (clear b8) (arm-empty)
   added: (holding b8) (clear b4)
   goals met: 2 of 11
6. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 3 of 11
7. (unstack b4 b6)
   deleted: (on b4 b6) (clear b4) (arm-empty)
   added: (holding b4) (clear b6)
   goals met: 3 of 11
8. (stack b4 b12)
   deleted: (clear b12) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b12)
   goals met: 3 of 11
9. (unstack b6 b9)
   deleted: (on b6 b9) (clear b6) (arm-empty)
   added: (holding b6) (clear b9)
   goals met: 3 of 11
10. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 3 of 11
11. (unstack b9 b5)
   deleted: (on b9 b5) (clear b9) (arm-empty)
   added: (holding b9) (clear b5)
   goals met: 3 of 11
12. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 3 of 11
13. (unstack b5 b10)
   deleted: (on b5 b10) (clear b5) (arm-empty)
   added: (holding b5) (clear b10)
   goals met: 4 of 11
14. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 11
15. (unstack b10 b3)
   deleted: (on b10 b3) (clear b10) (arm-empty)
   added: (holding b10) (clear b3)
   goals met: 4 of 11
16. (stack b10 b9)
   deleted: (clear b9) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b9)
   goals met: 5 of 11
17. (unstack b3 b2)
   deleted: (on b3 b2) (clear b3) (arm-empty)
   added: (holding b3) (clear b2)
   goals met: 5 of 11
18. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 6 of 11
19. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 6 of 11
20. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 7 of 11
21. (unstack b4 b12)
   deleted: (on b4 b12) (clear b4) (arm-empty)
   added: (holding b4) (clear b12)
   goals met: 7 of 11
22. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 8 of 11
23. (unstack b10 b9)
   deleted: (on b10 b9) (clear b10) (arm-empty)
   added: (holding b10) (clear b9)
   goals met: 7 of 11
24. (stack b10 b4)
   deleted: (clear b4) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b4)
   goals met: 9 of 11
25. (unstack b1 b11)
   deleted: (on b1 b11) (clear b1) (arm-empty)
   added: (holding b1) (clear b11)
   goals met: 9 of 11
26. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 9 of 11
27. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 9 of 11
28. (stack b11 b2)
   deleted: (clear b2) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b2)
   goals met: 10 of 11
29. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 10 of 11
30. (stack b6 b11)
   deleted: (clear b11) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b11)
   goals met: 11 of 11
